Repository: krishnapunjabi708/Team-INORA-Morpheus
Catalog: Farmmatrix_Sinhagad/lib/l10n/app_*.arb
Languages: hi, mr

# welcomeMessage
source: Welcome to FarmMatrix - Your Smart Farming Solution
hi: फार्ममैट्रिक्स में स्वागत है - आपका आसान खेती समाधान
mr: फार्ममॅट्रिक्समध्ये स्वागत - तुमचा सोपा शेती उपाय

source: Get Started
hi: शुरू करें
mr: सुरू करा

source: Select Language
hi: भाषा चुनें
mr: भाषा निवडा

source: Next
hi: आगे
mr: पुढे

source: English
hi: अंग्रेजी
mr: अंग्रेजी

source: Hindi
hi: हिन्दी
mr: हिन्दी

source: Marathi
hi: मराठी

source: Tamil
hi: तमिल

source: Punjabi
hi: पंजाबी

source: Telugu
hi: तेलुगु

source: Language:
hi: भाषा:

source: FARMMATRIX
hi: फार्ममैट्रिक्स
mr: फार्ममॅट्रिक्स

source: Log In
hi: लॉगिन करें
mr: लॉगिन करा

source: Full Name
hi: पूरा नाम
mr: पूर्ण नाव

# phoneNo
source: Phone Number
hi: फोन नंबर
mr: फोन नंबर

# pleaseEnterName
source: Please enter your name
hi: अपना नाम डालें
mr: कृपया तुमचं नाव टाका

# pleaseEnterPhoneNumber
source: Please enter your phone number
hi: अपना फोन नंबर डालें
mr: कृपया तुमचा फोन नंबर टाका

# invalidPhoneNumber
source: Please enter a valid phone number
hi: सही फोन नंबर डालें
mr: कृपया योग्य फोन नंबर टाका

# locationServiceDisabledTitle
source: Location Service Disabled
hi: जगह की सेवा बंद है
mr: स्थान सेवा बंद आहे

# locationServiceDisabledMessage
source: Location services are disabled. Please enable them to continue.
hi: जगह की सेवा बंद है। कृपया इसे चालू करें।
mr: स्थान सेवा बंद आहे. कृपया ती सुरू करा.

source: Cancel
hi: रद्द करें
mr: रद्द करा

source: Open Settings
hi: सेटिंग्स खोलें
mr: सेटिंग्ज उघडा

# locationPermissionRequiredTitle
source: Location Permission Required
hi: जगह की अनुमति चाहिए
mr: स्थान परवानगी हवी

# locationPermissionRequiredMessage
source: We need location permissions to provide better service.
hi: बेहतर सेवा के लिए हमें जगह की अनुमति चाहिए।
mr: चांगली सेवा देण्यासाठी आम्हाला स्थान परवानगी हवी आहे.

# locationPermissionPermanentlyDeniedTitle
source: Location Permission Permanently Denied
hi: जगह की अनुमति हमेशा के लिए बंद
mr: स्थान परवानगी कायमची नाकारली

# locationPermissionPermanentlyDeniedMessage
source: You have permanently denied location permissions. Please enable them in app settings.
hi: आपने जगह की अनुमति पूरी तरह से बंद कर दी है। कृपया ऐप सेटिंग्स में इसे चालू करें।
mr: तुम्ही स्थान परवानगी कायमची नाकारली आहे. कृपया अॅप सेटिंग्जमध्ये ती सुरू करा.

# locationServicesStillDisabled
source: Location services are still disabled
hi: जगह की सेवा अभी भी बंद है
mr: स्थान सेवा अजूनही बंद आहे

# locationServicesRequired
source: Location services are required
hi: जगह की सेवा जरूरी है
mr: स्थान सेवा आवश्यक आहे

# locationPermissionsStillDenied
source: Location permissions are still denied
hi: जगह की अनुमति अभी भी बंद है
mr: स्थान परवानगी अजूनही नाकारली आहे

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied
hi: जगह की अनुमति हमेशा के लिए बंद है
mr: स्थान परवानगी कायमची नाकारली आहे

source: Processing...
hi: काम चल रहा है...
mr: काम चालू आहे...

source: Good Morning
hi: सुप्रभात
mr: सुप्रभात

source: Good Afternoon
hi: शुभ दोपहर
mr: शुभ दुपार

source: Good Evening
hi: शुभ संध्या
mr: शुभ संध्या

source: Loading...
hi: लोड हो रहा है...
mr: लोड होत आहे...

source: Loading user...
hi: उपयोगकर्ता लोड हो रहा है...
mr: वापरकर्ता लोड होत आहे...

source: Current Field
hi: वर्तमान खेत
mr: सध्याचे शेत

# welcomeUser
source: Welcome, {name}
hi: नमस्ते, {name}
mr: नमस्कार, {name}

# defaultUser
source: User
hi: उपयोगकर्ता
mr: वापरकर्ता

# humidity
source: Humidity: {value}
hi: नमी: {value}
mr: आर्द्रता: {value}

source: Weather
hi: मौसम
mr: हवामान

source: Select Field
hi: खेत चुनें
mr: शेत निवडा

source: Add New Field
hi: नया खेत जोड़ें
mr: नवीन शेत जोडा

# selectedFieldLabel
source: Selected field:
hi: चुना हुआ खेत:
mr: निवडलेलं शेत:

source: No field selected
hi: कोई खेत नहीं चुना
mr: कोणतंही शेत निवडलेलं नाही

# manageFields
source: Manage your fields
hi: अपने खेतों का प्रबंधन करें
mr: तुमची शेतं व्यवस्थापित करा

source: Home
hi: होम
mr: होम

source: Dashboard
hi: डैशबोर्ड
mr: डॅशबोर्ड

# soilReportTitle
source: Soil Report
hi: मृदा रिपोर्ट
mr: मृदा अहवाल

# onboardingDesc1
source: A platform designed to help you understand your soil like never before.
hi: एक ऐसा प्लेटफॉर्म जो आपको अपनी मिट्टी को पहले से बेहतर समझने में मदद करता है।

# onboardingDesc2
source: Delivering clear soil fertility insights for smarter farming decisions.
hi: स्मार्ट खेती के लिए स्पष्ट मिट्टी उर्वरता जानकारी प्रदान करता है।

# soilReportDescription
source: Get a detailed analysis of soil nutrients and parameters with health score
hi: मृदा पोषक तत्वों और पैरामीटरों का विस्तृत विश्लेषण प्राप्त करें जिसमें स्वास्थ्य स्कोर शामिल है
mr: मातीतील पोषक घटक आणि पॅरामीटर्सचे सविस्तर विश्लेषण मिळवा ज्यात आरोग्य स्कोअर समाविष्ट आहे

# fertilityMappingTitle
source: Fertility Mapping
hi: उर्वरता मानचित्रण
mr: सुपीकता नकाशा

# fertilityMappingDescription
source: Get zone-wise fertility map on your selected field
hi: अपने चयनित खेत पर क्षेत्र-वार उर्वरता मानचित्र प्राप्त करें
mr: आपल्या निवडलेल्या शेतावर विभागनिहाय सुपीकता नकाशा मिळवा

# dashboardLabel
source: Dashboard
hi: डैशबोर्ड

source: View Map
hi: मानचित्र देखें
mr: नकाशा पहा

source: Profile
hi: प्रोफाइल
mr: प्रोफाइल

source: OK
hi: ठीक है
mr: ठीक

source: Skip
hi: छोड़ें

source: Change Language
hi: भाषा बदलें

# fieldMissing
source: Field data missing
hi: खेत का डेटा उपलब्ध नहीं है

source: API error
hi: API त्रुटि

source: Filter by nutrients
hi: पोषक तत्वों के अनुसार फ़िल्टर करें

# errorGettingLocation
source: Error getting location: {message}
hi: जगह ढूंढने में गलती: {message}
mr: स्थान मिळवण्यात चूक: {message}

source: Error fetching weather
hi: मौसम जानने में गलती
mr: हवामान मिळवण्यात चूक

# errorGettingAddress
source: Error getting address: {message}
hi: पता ढूंढने में गलती: {message}
mr: पत्ता मिळवण्यात चूक: {message}

source: Weather unavailable
hi: मौसम की जानकारी नहीं है
mr: हवामान माहिती उपलब्ध नाही

source: Error loading weather
hi: मौसम लोड करने में गलती
mr: हवामान लोड करण्यात चूक

# locationServicesDisabled
source: Location services are disabled.
hi: जगह की सेवा बंद है।
mr: स्थान सेवा बंद आहे.

# locationPermissionsDenied
source: Location permissions are denied.
hi: जगह की अनुमति नहीं दी गई।
mr: स्थान परवानगी नाकारली आहे.

# error
source: Error: {message}
hi: गलती: {message}
mr: चूक: {message}

source: Location not found.
hi: जगह नहीं मिली।
mr: स्थान सापडलं नाही.

# searchError
source: Search error: {message}
hi: खोज में गलती: {message}
mr: शोध चूक: {message}

source: Enter Field Name
hi: खेत का नाम डालें
mr: शेताचं नाव टाका

# enterFieldNameHint
source: Enter field name
hi: खेत का नाम डालें
mr: शेताचं नाव टाका

source: Save
hi: सहेजें
mr: जतन करा

# userIdNotFound
source: User ID not found. Please log in.
hi: उपयोगकर्ता आईडी नहीं मिली। कृपया लॉगिन करें।
mr: वापरकर्ता आयडी सापडला नाही. कृपया लॉगिन करा.

# invalidFieldData
source: Please fill in the field name and draw a valid polygon.
hi: खेत का नाम और सही आकार डालें।
mr: शेताचं नाव आणि योग्य आकार टाका.

# fieldSavedSuccess
source: Field '{fieldName}' saved successfully!
hi: खेत '{fieldName}' सफलतापूर्वक सहेजा गया!
mr: शेत '{fieldName}' यशस्वीपणे जतन झालं!

source: Search location...
hi: जगह खोजें...
mr: स्थान शोधा...

source: Clear Field
hi: खेत साफ करें
mr: शेत साफ करा

source: Clear
hi: साफ करें
mr: साफ करा

source: Confirm
hi: पक्का करें
mr: पुष्टी करा

# errorFetchingFields
source: Error fetching fields: {message}
hi: खेत की जानकारी लेने में गलती: {message}
mr: शेताची माहिती मिळवण्यात चूक: {message}

source: Error loading fields
hi: खेत लोड करने में गलती
mr: शेतं लोड करण्यात चूक

source: Retry
hi: फिर से कोशिश करें
mr: पुन्हा प्रयत्न करा

source: No fields added
hi: कोई खेत नहीं जोड़ा गया
mr: कोणतंही शेत जोडलेलं नाही

# addFieldPrompt
source: Please add your field to get started
hi: शुरू करने के लिए खेत जोड़ें
mr: सुरू करण्यासाठी शेत जोडा

# pleaseSelectAFieldFirst
source: Please select or add a field first
hi: कृपया पहले कोई खेत चुनें या जोड़ें
mr: कृपया आधी शेत निवडा किंवा जोडा

# noFieldsSelected
source: No fields selected for deletion
hi: हटाने के लिए कोई खेत नहीं चुना
mr: हटवण्यासाठी कोणतंही शेत निवडलेलं नाही

# fieldsDeletedSuccess
source: Selected fields deleted successfully
hi: चुने हुए खेत हटा दिए गए
mr: निवडलेली शेतं यशस्वीपणे हटवली

# errorDeletingFields
source: Error deleting fields: {message}
hi: खेत हटाने में गलती: {message}
mr: शेतं हटवण्यात चूक: {message}

source: Delete Selected
hi: चुने हुए हटाएँ
mr: निवडलेली हटवा

source: Fertility Mapping
hi: उर्वरता नक्शा
mr: सुपीकतेचा आढावा

source: Loading fertility map...
hi: उर्वरता नक्शा लोड हो रहा है...
mr: सुपीकता नकाशा लोड होत आहे...

# fertilityMapPeriod
source: Fertility Map: {startDate} to {endDate}
hi: उर्वरता नक्शा: {startDate} से {endDate} तक
mr: सुपीकता नकाशा: {startDate} ते {endDate}

# fertilityLow
source: Low
hi: कम
mr: कमी

# fertilityModerate
source: Moderate
hi: मध्यम
mr: मध्यम

# fertilityHigh
source: High
hi: ज्यादा
mr: जास्त

# fieldDataMissing
source: Field data or geometry missing
hi: खेत की जानकारी या आकार गायब है
mr: शेताची माहिती किंवा आकार गहाळ आहे

# invalidGeometry
source: Invalid geometry coordinates
hi: गलत आकार के निर्देशांक
mr: चुकीचे आकार समन्वय

# apiRequestFailed
source: API request failed: {statusCode}
hi: API अनुरोध विफल: {statusCode}
mr: API विनंती अयशस्वी: {statusCode}

# errorLoadingData
source: Error loading data: {message}
hi: डेटा लोड करने में गलती: {message}
mr: डेटा लोड करण्यात चूक: {message}

# soilReport
source: Advance Soil Report
hi: मिट्टी की रिपोर्ट
mr: मातीचा अहवाल

# languageLabel
source: Language:
hi: भाषा:
mr: भाषा:

# invalidCoordinates
source: Invalid coordinates format
hi: गलत निर्देशांक
mr: चुकीचे समन्वय

# failedToParseCoordinates
source: Failed to parse coordinates: {message}
hi: निर्देशांक समझने में गलती: {message}
mr: समन्वय समजण्यात अयशस्वी: {message}

# failedToParseGeometry
source: Failed to parse geometry: {message}
hi: आकार समझने में गलती: {message}
mr: आकार समजण्यात अयशस्वी: {message}

source: No coordinates available
hi: कोई निर्देशांक नहीं हैं
mr: कोणतेही समन्वय उपलब्ध नाहीत

# failedToLoadReport
source: Failed to load report: {message}
hi: रिपोर्ट लोड करने में गलती: {message}
mr: अहवाल लोड करण्यात अयशस्वी: {message}

# errorGeneratingReport
source: Error generating report: {message}
hi: रिपोर्ट बनाने में गलती: {message}
mr: अहवाल तयार करण्यात चूक: {message}

source: No PDF available
hi: कोई PDF नहीं है
mr: PDF उपलब्ध नाही

# reportDownloadedSuccess
source: Report downloaded successfully
hi: रिपोर्ट सफलतापूर्वक डाउनलोड हुई
mr: अहवाल यशस्वीपणे डाउनलोड झाला

# failedToDownloadReport
source: Failed to download report: {message}
hi: रिपोर्ट डाउनलोड करने में गलती: {message}
mr: अहवाल डाउनलोड करण्यात अयशस्वी: {message}

# errorLoadingPDF
source: Error loading PDF: {message}
hi: PDF लोड करने में गलती: {message}
mr: PDF लोड करण्यात चूक: {message}

source: Download Report
hi: रिपोर्ट डाउनलोड करें
mr: अहवाल डाउनलोड करा

source: Soil Monitoring Dashboard
hi: मिट्टी निगरानी डैशबोर्ड
mr: माती निरीक्षण डॅशबोर्ड

# fieldLabel
source: Field: {fieldName}
hi: खेत: {fieldName}
mr: शेत: {fieldName}

# noFieldSelectedMessage
source: No field selected or data unavailable. Please select a field from the Home screen.
hi: कोई खेत नहीं चुना गया या डेटा नहीं है। कृपया होम स्क्रीन से खेत चुनें।
mr: कोणतंही शेत निवडलेलं नाही किंवा डेटा उपलब्ध नाही. कृपया होम स्क्रीनवरून शेत निवडा.

source: Fertility Index (Default)
hi: उर्वरता सूचकांक (डिफ़ॉल्ट)

source: Nitrogen (N)
hi: नाइट्रोजन (N)

source: Phosphorus (P)
hi: फॉस्फोरस (P)

source: Potassium (K)
hi: पोटैशियम (K)

source: Organic Carbon (OC)
hi: जैविक कार्बन (OC)

source: Electrical Conductivity (EC)
hi: विद्युत चालकता (EC)

source: Calcium (Ca)
hi: कैल्शियम (Ca)

source: Magnesium (Mg)
hi: मैग्नीशियम (Mg)

source: Sulphur (S)
hi: सल्फर (S)

source: Soil pH
hi: मिट्टी का पीएच
mr: मातीचा पीएच

source: Water Content
hi: पानी की मात्रा
mr: पाण्याची मात्रा

source: Organic Carbon
hi: जैविक कार्बन
mr: सेंद्रिय कार्बन

source: Land Surface Temperature
hi: जमीन का तापमान
mr: जमिनीचं तापमान

source: Soil Texture
hi: मिट्टी की बनावट
mr: मातीची रचना

source: Soil Salinity
hi: मिट्टी की नमकीनता
mr: मातीची खारटपणा

source: Nutrients Holding Capacity
hi: पोषक तत्व रखने की क्षमता
mr: पोषक तत्व ठेवण्याची क्षमता

# nutrientsHoldingCapacityLine1
source: Nutrients
hi: पोषक तत्व
mr: पोषक

# nutrientsHoldingCapacityLine2
source: Holding
hi: रखने
mr: तत्व

# nutrientsHoldingCapacityLine3
source: Capacity
hi: की
mr: ठेवण्याची

source: Insights
hi: जानकारी
mr: माहिती

source: N/A
hi: नहीं है
mr: उपलब्ध नाही

source: Data unavailable
hi: डेटा नहीं है
mr: डेटा उपलब्ध नाही

source: Unknown
hi: पता नहीं
mr: माहीत नाही

# errorFetchingFieldData
source: Error fetching field data: {message}
hi: खेत का डेटा लेने में गलती: {message}
mr: शेताचा डेटा मिळवण्यात चूक: {message}

# errorFetchingData
source: Error fetching data: {message}
hi: डेटा लेने में गलती: {message}
mr: डेटा मिळवण्यात चूक: {message}

# phStatusIdeal
source: Ideal
hi: उत्तम
mr: उत्तम

# phStatusAcceptable
source: Acceptable
hi: ठीक
mr: ठीक

# phStatusPoor
source: Poor
hi: खराब
mr: खराब

# phTooltipIdeal
source: Ideal / Good condition
hi: उत्तम / अच्छी स्थिति
mr: उत्तम / चांगली स्थिती

# phTooltipMildlyAcidicAlkaline
source: Mildly acidic or alkaline
hi: हल्का अम्लीय या क्षारीय
mr: थोडं अम्लीय किंवा क्षारीय

# phTooltipCorrectionNeeded
source: Soil correction needed
hi: मिट्टी को सुधारने की जरूरत
mr: माती दुरुस्तीची गरज

# textureLoam
source: Loam
hi: दोमट
mr: दोमट

# textureSandyLoam
source: Sandy Loam
hi: बलुई दोमट
mr: वाळू मिश्रित दोमट

# textureSiltyLoam
source: Silty Loam
hi: गाद दोमट
mr: गाळ मिश्रित दोमट

# textureTooltipGood
source: Good soil texture
hi: अच्छी मिट्टी की बनावट
mr: चांगली मातीची रचना

# textureTooltipWorkable
source: Workable, but needs improvement
hi: काम करने लायक, लेकिन सुधार चाहिए
mr: काम करण्या योग्य, पण सुधारणा हवी

# textureTooltipOrganicMatter
source: Add organic matter
hi: जैविक खाद डालें
mr: सेंद्रिय खत घाला

# salinityStatusVeryLow
source: Very Low Salinity
hi: बहुत कम नमकीनता
mr: खूप कमी खारटपणा

# salinityStatusLow
source: Low Salinity
hi: कम नमकीनता
mr: कमी खारटपणा

# salinityStatusModerate
source: Moderate Salinity
hi: मध्यम नमकीनता
mr: मध्यम खारटपणा

# salinityStatusHigh
source: High Salinity
hi: ज्यादा नमकीनता
mr: जास्त खारटपणा

# salinityStatusVeryHigh
source: Very High Salinity
hi: बहुत ज्यादा नमकीनता
mr: खूप जास्त खारटपणा

# salinityTooltipExcellent
source: Excellent for crops
hi: फसलों के लिए बहुत अच्छा
mr: पिकांसाठी उत्तम

# salinityTooltipSuitable
source: Suitable for most crops
hi: ज्यादातर फसलों के लिए ठीक
mr: बहुतेक पिकांसाठी योग्य

# salinityTooltipMonitor
source: Monitor, may affect sensitive crops
hi: नजर रखें, संवेदनशील फसलों पर असर हो सकता है
mr: लक्ष ठेवा, संवेदनशील पिकांवर परिणाम होऊ शकतो

# salinityTooltipTreatment
source: Needs treatment (gypsum, leaching)
hi: इलाज चाहिए (जिप्सम, पानी से धोना)
mr: उपचार हवे (जिप्सम, पाण्याने धुणे)

# salinityTooltipPoor
source: Poor soil, not ideal for farming
hi: खराब मिट्टी, खेती के लिए अच्छी नहीं
mr: खराब माती, शेतीसाठी योग्य नाही

# organicCarbonStatusRich
source: Rich Organic Carbon
hi: ज्यादा जैविक कार्बन
mr: जास्त सेंद्रिय कार्बन

# organicCarbonStatusModerate
source: Moderate Organic Carbon
hi: मध्यम जैविक कार्बन
mr: मध्यम सेंद्रिय कार्बन

# organicCarbonStatusLow
source: Low Organic Carbon
hi: कम जैविक कार्बन
mr: कमी सेंद्रिय कार्बन

# organicCarbonStatusWaterBody
source: Water Body
hi: पानी का क्षेत्र
mr: पाण्याचा भाग

# organicCarbonTooltipGood
source: Good fertility
hi: अच्छी उर्वरता
mr: चांगली सुपीकता

# organicCarbonTooltipCompost
source: Add compost to increase fertility
hi: उर्वरता बढ़ाने के लिए खाद डालें
mr: सुपीकता वाढवण्यासाठी खत घाला

# organicCarbonTooltipLow
source: Low fertility
hi: कम उर्वरता
mr: कमी सुपीकता

# cecStatusHigh
source: High
hi: ज्यादा
mr: जास्त

# cecStatusAverage
source: Average
hi: मध्यम
mr: मध्यम

# cecStatusLow
source: Low
hi: कम
mr: कमी

# cecTooltipHigh
source: High nutrient holding
hi: ज्यादा पोषक तत्व रखने की क्षमता
mr: जास्त पोषक तत्व ठेवण्याची क्षमता

# cecTooltipAverage
source: Average nutrient holding
hi: मध्यम पोषक तत्व रखने की क्षमता
mr: मध्यम पोषक तत्व ठेवण्याची क्षमता

# cecTooltipLow
source: Soil lacks holding power
hi: मिट्टी में पोषक तत्व रखने की कमी
mr: मातीत पोषक तत्व ठेवण्याची कमतरता

# lstStatusCool
source: Cool Zone
hi: ठंडा क्षेत्र
mr: थंड क्षेत्र

# lstStatusOptimal
source: Optimal temperature
hi: सही तापमान
mr: योग्य तापमान

# lstStatusModerate
source: Moderate heat
hi: मध्यम गर्मी
mr: मध्यम उष्णता

# lstStatusHigh
source: High heat stress
hi: ज्यादा गर्मी का तनाव
mr: जास्त उष्णता ताण

# lstStatusExtreme
source: Extreme stress
hi: बहुत ज्यादा तनाव
mr: खूप जास्त ताण

# lstTooltipCool
source: Ideal for most crops; low evapotranspiration
hi: ज्यादातर फसलों के लिए अच्छा; कम पानी का नुकसान
mr: बहुतेक पिकांसाठी योग्य; कमी बाष्पीभवन

# lstTooltipOptimal
source: Supports active crop growth
hi: फसलों की वृद्धि के लिए ठीक
mr: पिकांच्या वाढीसाठी आधार देतं

# lstTooltipModerate
source: May need light irrigation
hi: हल्की सिंचाई की जरूरत हो सकती है
mr: थोडी पाण्याची गरज असू शकते

# lstTooltipHigh
source: Irrigation required; avoid sowing sensitive crops
hi: सिंचाई जरूरी; संवेदनशील फसलों से बचें
mr: पाण्याची गरज; संवेदनशील पिकं टाळा

# lstTooltipExtreme
source: Immediate action needed; consider shade or mulching
hi: तुरंत कार्रवाई करें; छाया या मल्चिंग करें
mr: तात्काळ कृती करा; सावली किंवा मल्चिंग करा

# waterContentStatusWaterBody
source: Water body/Lake
hi: पानी का क्षेत्र/झील
mr: पाण्याचा भाग/ताल

# waterContentStatusAdequate
source: Adequate moisture
hi: पर्याप्त नमी
mr: पुरेसं पाणी

# waterContentStatusMild
source: Mild stress
hi: हल्की नमी की कमी
mr: थोडा पाण्याचा ताण

# waterContentStatusModerate
source: Moderate stress
hi: मध्यम नमी की कमी
mr: मध्यम पाण्याचा ताण

# waterContentStatusDry
source: Dry
hi: सूखा
mr: कोरडं

# waterContentTooltipWaterBody
source: It is a water body or a lake
hi: यह पानी का क्षेत्र या झील है
mr: हा पाण्याचा भाग किंवा तलाव आहे

# waterContentTooltipAdequate
source: Soil/vegetation moisture is adequate—no immediate irrigation needed
hi: मिट्टी/पौधों में नमी ठीक है—सिंचाई की जरूरत नहीं
mr: माती/झाडांमधील पाणी पुरेसं आहे—तात्काळ पाण्याची गरज नाही

# waterContentTooltipMild
source: Mild moisture stress—consider light irrigation soon
hi: हल्की नमी की कमी—जल्दी हल्की सिंचाई करें
mr: थोडा पाण्याचा ताण—लवकर थोडं पाणी द्या

# waterContentTooltipModerate
source: Moderate stress—plan irrigation within few days
hi: मध्यम नमी की कमी—कुछ दिनों में सिंचाई करें
mr: मध्यम पाण्याचा ताण—काही दिवसांत पाणी द्या

# waterContentTooltipDry
source: Severe moisture deficit—irrigate immediately
hi: नमी की बहुत कमी—तुरंत सिंचाई करें
mr: पाण्याची खूप कमतरता—तात्काळ पाणी द्या

source: Account
hi: खाता
mr: खातं

# helloUser
source: Hello, {name}
hi: नमस्ते, {name}
mr: नमस्कार, {name}

source: No phone
hi: कोई फोन नहीं
mr: फोन नाही

source: My Fields
hi: मेरे खेत
mr: माझी शेतं

source: Government Schemes
hi: सरकारी योजनाएँ
mr: सरकारी योजना

source: Logout
hi: लॉगआउट
mr: लॉगआउट

source: Refresh User Data
hi: उपयोगकर्ता जानकारी ताज़ा करें
mr: वापरकर्ता माहिती ताज्या करा

# noUserIdFound
source: No user ID found in SharedPreferences
hi: उपयोगकर्ता आईडी नहीं मिली। कृपया लॉगिन करें।
mr: वापरकर्ता आयडी सापडला नाही

# errorFetchingUserData
source: Error fetching user data: {message}
hi: उपयोगकर्ता जानकारी लेने में गलती: {message}
mr: वापरकर्ता माहिती मिळवण्यात चूक: {message}

# errorLoggingOut
source: Error logging out: {message}
hi: लॉगआउट करने में गलती: {message}
mr: लॉगआउट करण्यात चूक: {message}

# errorDecodingField
source: Error decoding saved field: {message}
hi: खेत की जानकारी समझने में गलती: {message}
mr: शेताची माहिती समजण्यात चूक: {message}

# selectedField
source: Selected field: {fieldName}
hi: चुना हुआ खेत: {fieldName}
mr: निवडलेलं शेत: {fieldName}

source: Pradhan Mantri Fasal Bima Yojana
hi: प्रधानमंत्री फसल बीमा योजना
mr: प्रधानमंत्री पीक विमा योजना

source: Kisan Credit Card Scheme
hi: किसान क्रेडिट कार्ड योजना
mr: किसान क्रेडिट कार्ड योजना

source: Paramparagat Krishi Vikas Yojana
hi: परंपरागत खेती विकास योजना
mr: पारंपरिक शेती विकास योजना

source: Your Selected Field
hi: आपका चुना हुआ खेत
mr: तुमचं निवडलेलं शेत

source: Loading field map...
hi: खेत का नक्शा लोड हो रहा है...
mr: शेताचा नकाशा लोड होत आहे...

source: FarmMatrix Assistant
hi: फार्ममैट्रिक्स सहायक
mr: फार्ममॅट्रिक्स सहाय्यक

source: Chat History
hi: चैट का इतिहास
mr: चॅट इतिहास

source: New Chat
hi: नई चैट
mr: नवीन चॅट

source: Ask your assistant
hi: अपने सहायक से पूछें
mr: तुमच्या सहाय्यकाला विचारा

source: Ask anything
hi: कुछ भी पूछें
mr: काहीही विचारा

source: Rename
hi: नाम बदलें
mr: नाव बदला

source: Delete
hi: हटाएँ
mr: हटवा

source: Rename Chat
hi: चैट का नाम बदलें
mr: चॅटचं नाव बदला

source: Enter new chat name
hi: नया चैट नाम डालें
mr: नवीन चॅट नाव टाका

source: Delete Chat
hi: चैट हटाएँ
mr: चॅट हटवा

# deleteChatConfirmation
source: Are you sure you want to delete this chat? This action cannot be undone.
hi: क्या आप सचमुच इस चैट को हटाना चाहते हैं? इसे वापस नहीं लाया जा सकता।
mr: तुम्हाला खरंच हा चॅट हटवायचा आहे का? ही कृती परत करता येणार नाही.

# apiErrorMessage
source: Sorry, I couldn't process your request. Please try again.
hi: माफ करें, आपका अनुरोध पूरा नहीं हुआ। फिर से कोशिश करें।
mr: माफ करा, तुमची विनंती पूर्ण करू शकलो नाही. पुन्हा प्रयत्न करा.

# soilHealthHistoryTitle
source: Soil Health History
hi: मिट्टी स्वास्थ्य इतिहास

# soilHealthHistoryDescription
source: A track record of historic trends of your soil parameters
hi: आपकी मिट्टी के मापदंडों के ऐतिहासिक रुझानों का विस्तृत रिकॉर्ड

source: View History
hi: इतिहास देखें

source: Soil Health History
hi: मिट्टी स्वास्थ्य इतिहास

source: Selected Parameter
hi: चयनित पैरामीटर

source: Summary
hi: सारांश

source: Filter
hi: फ़िल्टर

source: Select Soil Parameter
hi: मिट्टी पैरामीटर चुनें

source: Apply
hi: लागू करें

source: No Data Available
hi: कोई डेटा उपलब्ध नहीं

# pleaseSelectParameter
source: Please select the parameter from filter
hi: कृपया फ़िल्टर से पैरामीटर चुनें

source: Select Date Range
hi: तिथि सीमा चुनें

source: Last month
hi: पिछला महीना

source: Custom
hi: कस्टम
